Revit 2024 API
ElementOnPhaseStatus Enumeration
 The statuses that an element can have with respect to a given phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum ElementOnPhaseStatus
Visual Basic
Public Enumeration ElementOnPhaseStatus
Visual C++
public enum class ElementOnPhaseStatus
Members
Member name | Description
None |  Phase status is undefined (e.g., for annotations)
Past |  Created and demolished before the given phase
Existing |  Created in a previous phase, existing through the end of the given phase
Demolished |  Created before the given phase, to be demolished on the given phase
New |  Created on this phase (and not demolished)
Temporary |  Created and demolished during this phase
Future |  Created after this phase
See Also
Autodesk.Revit.DB Namespace